import styles from "./CookiePolicyPage.module.scss"

export default function CookiePolicyPage () {

    const cookieContent = [
        "ПОЛИТИКА COOKIE"
        ,"1. Политика использования файлов сookie (далее — «Политика») применяется в дополнение к общей Политике конфиденциальности (https://ApplicationP2E.com/privacyPolicy), которая распространяется на продукты и сервисы (далее — «Сервисы») ApplicationP2E LLC (Limited Liability Company) IN 412753685 (далее — «ApplicationP2E») и на сайт, размещённый по адресу ApplicationP2E.com (далее — «сайт»). Текущая версия доступна по адресу: https://ApplicationP2E.com/cookiePolicy"
        ,"2. ЧТО ТАКОЕ COOKIE И ДЛЯ ЧЕГО ИХ ИСПОЛЬЗУЕТ ApplicationP2E"
        ,"2.1. Файлы cookie — это маленькие фрагменты данных с определённой (часто технической) информацией, которые сервер отправляет на ваше устройство, чтобы запомнить информацию о ваших предпочтениях. Данная информация используется Сайтом для анализа ваших действий и отображения Сайта в удобном для вас формате. Например, с помощью файла Cookie locale наш Сайт и прочие Сервисы предлагают вам просматривать информацию на том языке, которым вы обычно пользуетесь (или какой вы самостоятельно выбрали)."
        ,"2.2. При использовании файлов cookie ApplicationP2E руководствуется нормами международного законодательства и законодательства ЕС, России, Украины и Грузии. В частности, данная политика соответствует нормам Федерального закона от 27.07.2006 N 152-ФЗ (ред. от 02.07.2021) «О персональных данных», Закону Украины о «Защите персональных данных», Закону Грузии «О защите персональных данных», а также закону ЕС 2016/679 (GDPR)."
        ,"3. СТОРОННИЕ ФАЙЛЫ COOKIE И ПЕРИОД ХРАНЕНИЯ"
        ,"3.1. Сторонние файлы cookie — это фрагменты данных с определённой информацией, которые могут запомнить и собирать информацию о ваших предпочтениях для сторонних сайтов и услуг не связанных с нашим Сайтом. Использование этих файлов на нашем сайте позволяет нам и нашим партнёрам анализировать активность при использовании Сервисов. Мы не несём ответственности за нарушения закона со стороны сторонних ресурсов, услуг или сайтов. Для отключения таких файлов cookie используйте наш инструмент, размещённый по адресу: https://ApplicationP2E.com/cookiePolicy#cookie-preferences."
        ,"3.2. ApplicationP2E использует сессионные файлы cookie, чтобы предоставить вам более удобное использование наших Сервисов. Например, при помощи файла cookie PHPSESSID, запоминаются ваши выборы во время авторизации в Сервисах и, например, при прохождении теста CAPTCHA. Срок действия сессионных файлов cookie истекает в конце сессии (когда вы закрываете страницу или окно браузера). Более подробно о сроках хранения и примерах использование различных файлов cookie описано в п.п.3.3.; 4.1.3. данной Политики."
        ,"3.3. При первом посещении Сервисов во всплывающем окне (либо с помощью другого технического решения) вам может быть предложено выбрать типы файлов cookie, которые будут записаны на вашем устройстве. Обратите внимание, что технические файлы cookie устанавливаются автоматически при загрузке страницы, если иное не указано в настройках вашего браузера. Если вы одобрили использование файлов cookie, но затем хотите поменять своё решение, вы можете воспользоваться нашим инструментом (https://ApplicationP2E.com/cookiePolicy#cookie-preferences) или удалить файлы самостоятельно с помощью функциональности вашего браузера."
        ,"3.4. Некоторые типы файлов cookie могут сохраняться вне зависимости от вашего выбора, если эти файлы необходимы нам для соблюдения требований законодательства или выполнения обязательств по контракту, а также в других случаях, в рамках закона."
        ,"4. КАКИЕ ФАЙЛЫ COOKIE ИСПОЛЬЗУЕТ ApplicationP2E"
        ,"4.1. Технические — необходимые для корректной работы сайта."
        ,"4.1.2. Технические файлы cookie необходимы для правильной работы Сайта и предоставления полной функциональности Сервисов. Их отключение может привести к некорректной работе Сайта или Услуг."
        ,"Примеры:"
        ,"4.1.3. «Locale» и «cy» — эти файлы cookie необходимы нам для того, чтобы запомнить ваш выбор касательно валюты и языка, на котором отображается наш Сайт и предоставляются Сервисы. Период хранения этих файлов cookie составляет 100 (сто) дней с момента записи."
        ,"4.2. Аналитические и маркетинговые файлы cookie — опциональные файлы cookie."
        ,"4.2.1. Данные файлы cookie позволяют нам анализировать эффективность работы нашего Сайта и Сервисов. Подобный анализ включает в себя методы статистического анализа, агрегированные данные, а также данные, которые собираются для целей маркетинга сторонними файлами cookie."
        ,"Примеры:"
        ,"4.2.3. Инструмент веб-аналитики Google Analytics, который используется Google и размещён на нашем Сайте, позволяет нам собирать обезличенную информацию об источниках трафика, посещаемости сайта и оценивать эффективность рекламы. Для учёта посетителей Google Analytics использует анонимные идентификаторы браузеров, которые сохраняются в файлах cookie. Подробнее о файлах cookie Google Analytics можно прочитать на странице https://policies.google.com/technologies/partner-sites?hl=ru."
        ,"4.3. Если вы используете несколько браузеров или компьютеров в разных местах, то убедитесь, что ваш выбор соответствует вашим предпочтением на каждом устройстве."
        ,"4.4. Вы можете самостоятельно удалить все файлы cookie, которые хранятся на вашем браузере, с помощью стандартной функциональности браузера. Для каждого вида браузера существует отдельная процедура управления вашим выбором хранения файлов cookie."
        ,"Microsoft Edge: https://support.microsoft.com/ru-ru/microsoft-edge/%D1%83%D0%B4%D0%B0%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D1%84%D0%B0%D0%B9%D0%BB%D0%BE%D0%B2-cookie-%D0%B2-microsoft-edge-63947406-40ac-c3b8-57b9-2a946a29ae09."
        ,"Google Chrome: https://support.google.com/chrome/answer/95647?hl=ru&p=cpn_cookies."
        ,"Mozilla Firefox: https://support.mozilla.org/ru/kb/udalenie-kukov-dlya-udaleniya-informacii-kotoruyu-."
        ,"Apple Safari: https://support.apple.com/ru-ru/guide/safari/sfri11471/mac."
        ,"5. ОБЩИЕ ПОЛОЖЕНИЯ"
        ,"5.1. Если эта Политика переведена на другой язык, и между двумя языковыми версиями этой политики существуют коллизии, то английская версия этой Политики, размещённая по адресу: https://ApplicationP2E.com/en/cookiePolicy, превалирует и считается главной."
        ,"6. ОБРАТНАЯ СВЯЗЬ"
        ,"6.1. ApplicationP2E приветствует ваши вопросы и предложения, касающиеся исполнения или изменения настоящей Политики. Пожалуйста, воспользуйтесь нашей формой обратной связи, размещённой по адресу. Вы также можете воспользоваться этой формой (и адресом электронной почты a@ApplicationP2E.com) для направления запросов о реализации ваших прав или жалоб относительно некорректности вашей Персональной информации или незаконности её обработки."
        ,"6.2. Обратите внимание, что ApplicationP2E имеет отдельные принципы обработки запросов субъекта персональных данных. Текущая версия доступна по адресу: https://ApplicationP2E.com/dsar."
    ]
    return(
        <div className={styles.container}>
        <h1 className={styles.title}>Политика конфиденциальности</h1>
            <div className={styles.line}></div>
            {cookieContent.map((item, index) => {
                return(
                <div className={styles.element} key={index}>
                    {item}
                    <br/>
                    <br/>
                </div>
                )
            })}
            <div className={styles.line}></div>
            <div className={styles.footer}>
               Дата вступления в силу: 2000-00-00
               <br/>
               <br/>
               Постоянная ссылка: https://ApplicationP2E.com/cookiePolicy
               <br/>
               <br/>
            </div>
        </div>
    )
}