import { ApiService } from "../../api/ApiService";
import styles from "./PrivacyPolicyPage.module.scss"
import { useEffect, useState } from "react"



export default function PrivacyPolicyPage () {
const privacyContent = [
    "ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ"
    ,"1. Настоящая политика конфиденциальности (далее — Политика) действует в отношении всей информации, включая персональные данные в понимании применимого законодательства (далее — «Персональная информация»), которую ApplicationP2E LLC (Limited Liability Company) IN 412753685 (далее — «ApplicationP2E») может получить о вас в процессе использования вами любых сайтов, программ, продуктов и/или сервисов ApplicationP2E (далее вместе — «Сервисы»), информацию о которых вы можете найти на сайтах ApplicationP2E.com (далее – «Сайт») и других принадлежащих ApplicationP2E сайтах (далее вместе — «Сайты»), а также в ходе исполнения ApplicationP2E любых соглашений и договоров, заключённых с вами в связи с использованием вами Сервисов."
    ,"2. ОБЩИЕ ПОЛОЖЕНИЯ"
    ,"2.1. ApplicationP2E может также получать Персональную информацию от своих партнёров (далее — «Партнёры»), сайты, программы, продукты или сервисы которых вы используете (например, от рекламодателей ApplicationP2E). В таких случаях передача Персональной информации возможна только в случаях, установленных применимым законодательством, и осуществляется на основании специальных договоров между ApplicationP2E и каждым из Партнёров."
    ,"2.2. Пожалуйста, обратите внимание, что использование любого из Сайтов и/или Сервисов может регулироваться дополнительными условиями, которые могут вносить в настоящую Политику изменения и/или дополнения, и/или иметь специальные условия в отношении персональной информации, размещённые в соответствующих разделах документов для таких Сайтов /или Сервисов. Обратите внимание на нашу политику cookie (https://ApplicationP2E.com/cookiePolicy) и наши Принципы обработки запросов субъекта персональных данных (https://ApplicationP2E.com/dsar)."
    ,"2.3. При обработке персональных данных ApplicationP2E руководствуется нормами международного законодательства и законодательства ЕС, России, Украины и Грузии. В частности, данная политика соответствует нормам Федерального закона от 27.07.2006 N 152-ФЗ (ред. от 02.07.2021) «О персональных данных», Закону Украины о «Защите персональных данных», Закону Грузии «О защите персональных данных», а также закону ЕС 2016/679 (GDPR)."
    ,"2.4. При внесении существенных изменений в Политику мы сообщим вам об этом. ApplicationP2E также может попросить ваше согласие на продолжение обработки персональных данных, даже если вы давали подобное согласие до этого."
    ,"2.5. ApplicationP2E приветствует ваши вопросы и предложения, касающиеся исполнения или изменения настоящей Политики. Пожалуйста, воспользуйтесь нашей формой обратной связи, размещённой по адресу: https://support.ApplicationP2E.com/hc/ru/requests/new. Вы также можете воспользоваться этой формой (и адресом электронной почты a@ApplicationP2E.com) для направления запросов о реализации ваших прав или жалоб относительно некорректности вашей Персональной информации или незаконности её обработки."
    ,"3. КАКОВА ЦЕЛЬ ДАННОЙ ПОЛИТИКИ"
    ,"3.1. Защита вашей Персональной информации и вашей конфиденциальности чрезвычайно важны для ApplicationP2E. При использовании вами Сайтов и Сервисов ApplicationP2E защищает и обрабатывает вашу Персональную информацию в строгом соответствии с применимым законодательством. Следуя нашим обязанностям защищать вашу Персональную информацию, в этой Политике мы хотели бы наиболее прозрачно проинформировать вас о следующих моментах:"
    ,"3.2. Торговая информация и заказы."
    ,"3.2.1. Любые персональные данный которые вы предоставляете нам и/или другим пользователям нашего Сайта, когда оформляете заказ, отвечаете на сообщение, принимаете условия заказа, обсуждаете детали транзакции и/или совершаете прочие действия связанные с торговыми услугами и Сервисами на нашем Сайте. Примерами данных, которые мы собираем, могут быть следующие данные, включая, но не ограничиваясь: данные вашей учётной записи, информация необходимая для доступа в личный кабинет, адрес электронной почты."
    ,"3.3. Регистрация и использование форм."
    ,"3.3.1. Персональная информация, предоставленная вами при регистрации (создании учётной записи), заполнении форм (форма обратной связи), обращении в службу поддержки. Например: ваше имя, адрес IP, адрес электронной почты, файлы cookie."
    ,"3.4. Данные и контент, хранящиеся в системах ApplicationP2E."
    ,"3.4.1 Информация о вашей активности во время использования Сайтов и/или Сервисов. Например, данные о покупках в Сервисах, данные использования самих Сервисов, информация о взаимодействии с другими пользователями, а также файлы и контент, хранящиеся в системах ApplicationP2E, включая ваши отзывы на сторонних сайтах и/или ресурсах, комментарии о качестве наших Служб и/или Сайта, а также любые данные необходимые нам для успешного рассмотрения жалоб и работы службы арбитража."
    ,"3.5. Решение споров."
    ,"3.5.1. Успешное рассмотрение жалоб и корректная работа нашей службы арбитража очень важны для нас и нашей возможности предоставлять вам наши услуги. Поэтому нам может потребоваться определённый набор персональных данных для полноценного рассмотрения ваших жалоб или жалоб, которые могут вас касаться. ApplicationP2E оставляет за собой право опубликовать и/или использовать отдельные типы персональных данных, необходимые для защиты своей предпринимательской репутации и репутации бренда."
    ,"3.6. Технические данные и аналитика."
    ,"3.6.1. Для подробного анализа и сбора технических данных ApplicationP2E используем набор функций (включая файлы cookie), которые могут собирать ваши персональные данные. ApplicationP2E также использует сторонние инструменты веб-аналитики для того, чтобы собирать информацию об источниках трафика, посещаемости сайта и оценки эффективности наших Служб. Например, мы используем: инструмент веб-аналитики Яндекс.Метрика, инструмент веб-аналитики Google Analytics. Типы персональных данных, которые мы собираем таким образом: дата и время осуществления доступа к Сайтам и/или Сервисам, электронные данные (HTTP-заголовки, IP-адрес, файлы cookie, данные об идентификаторе браузера и программном обеспечении)."
    ,"3.6.2. Для более подробной информации о том, как мы используем Яндекс.Метрику и Google Analytics обратите внимание на п.п.4.1. этой Политики, а также на п.п.4.2.2. и п.п. 4.2.3. нашей Политики cookie (https://ApplicationP2E.com/cookiePolicy)."
    ,"3.7. Чувствительные персональные данные."
    ,"3.7.1. ApplicationP2E не собирает целенаправленно чувствительную персональную информацию (такую как расовое происхождение, политические взгляды, информация о здоровье и биометрические данные), за исключением случаев, предусмотренных законом."
    ,"4. КТО ЕЩЁ ИМЕЕТ ДОСТУП К ВАШЕЙ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ И КОМУ ОНА МОЖЕТ БЫТЬ ПЕРЕДАНА"
    ,"4.1. ApplicationP2E может передавать вашу Персональную информацию своим сотрудникам (в пределах, предусмотренных актуальным законодательством). ApplicationP2E также может передавать вашу Персональную информацию своим аффилированным лицам, в том числе третьим лицам и службами, с которыми ApplicationP2E сотрудничает. Обратите внимание, что уровень защиты Персональной информации в некоторых странах может не совпадать с уровнем, установленном в вашей юрисдикции, и, используя наши Сервисы и/или Сайт, вы соглашаетесь на такую передачу. К третьим лицам относятся: инструменты веб-аналитики Яндекс.Метрика, Google Analytics, Zendesk, Tome."
    ,"4.2. ApplicationP2E может получить некоторые данные от третьих лиц, которые могут потребоваться нам в рамках закона или для соблюдения обязательств по договору, например, ваши платёжные данные (маска платёжной карты)."
    ,"4.3. При обработке данных, полученных способом, что указан в п.п. 4.1. ApplicationP2E руководствуется нормами международного законодательства и законодательства ЕС, России, Украины и Грузии."
    ,"5. КАКОВА ПРАВОВАЯ ОСНОВА И ЦЕЛИ ОБРАБОТКИ ВАШЕЙ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ"
    ,"5.1. В дополнение к п.3. этой Политики, ApplicationP2E обрабатывает вашу Персональную информацию только в том случае, если:"
    ,"5.1.1. Предоставление доступа к вашей учётной записи, включая настройки личного кабинета и прочие инструменты нашего Сайта."
    ,"5.1.2. Обработка необходима для выполнения договорных обязательств ApplicationP2E перед вами, включая обеспечение работы Сайтов и Сервисов."
    ,"5.1.3. Обработка необходима для соблюдения установленных законодательством обязательств."
    ,"5.1.4. Обработка необходима для улучшения качества наших услуг и/или чтобы понять, как вы взаимодействуете с нашими Сайтами и/или Сервисами."
    ,"5.1.5. Когда это предусмотрено применимым законодательством, обработка необходима для обеспечения законных интересов ApplicationP2E только в тех случаях, если такая обработка не оказывает существенного влияния и не наносит ущерб вашим интересам, правам и свободам."
    ,"5.2. Для конкретных целей либо в соответствии с требованием применимого законодательства мы можем запросить ваше отдельное согласие на обработку вашей Персональной информации. Для юрисдикций, где согласие признаётся отдельным правовым основанием, начало использования вами Сайтов и/или Сервисов ApplicationP2E выражает ваше согласие с такой обработкой. Настоящим мы информируем вас, а вы подтверждаете, что у вас нет никаких обязательств по предоставлению нам какой-либо Персональной информации при использовании вами Сайтов или Услуг и основано исключительно на вашей свободной воле. Вместе с тем вы осознаёте, что без предоставления Персональной информации мы не сможем предоставить вам возможность воспользоваться Сервисами, а использование вами Сайтов будет ограничено."
    ,"5.3. ApplicationP2E всегда обрабатывает вашу Персональную информацию в целях, что указаны в п.5. и только ту Персональную информацию, которая имеет отношение к достижению таких целей."
    ,"5.4. Иногда ApplicationP2E может использовать технические решения, инструменты и сервисы третьих лиц (например, сервисы нашего платёжного партнёра Tome). Данные решения, инструменты и сервисы могут обрабатывать ваши данные для целей, которые отличаются от тех, что указаны в п.5. данной Политики. ApplicationP2E не несёт ответственности за практики обработки персональных данных третьих лиц. Несмотря на это, мы приветствуем ваши вопросы и предложения, касающиеся обработки ваших данных третьими лицами. Пожалуйста, воспользуйтесь нашей формой обратной связи, размещённой по адресу (https://support.ApplicationP2E.com/hc/ru/requests/new), чтобы связаться с нами."
    ,"6. КАК МЫ ИСПОЛЬЗУЕМ ФАЙЛЫ COOKIE"
    ,"6.1. Файлы cookie – это маленькие фрагменты данных с определённой (часто технической) информацией, которые сервер отправляет на ваше устройство, чтобы запомнить информацию о ваших предпочтениях. Данная информация используется Сайтом для анализа ваших действий и отображения Сайта в удобном для вас формате. Например, с помощью файла Cookie locale наш Сайт и прочие Сервисы предлагают вам просматривать информацию на том языке, которым вы обычно пользуетесь (или какой вы самостоятельно выбрали)."
    ,"6.2. ApplicationP2E использует сессионные файлы cookie, чтобы предоставить вам более удобное использование нашими Сервисами. Например, при помощи файла cookie PHPSESSID и golden_key, запоминаются ваши выборы во время авторизации в Сервисах и, например, при прохождении теста CAPTCHA. Срок действия сессионных файлов cookie истекает в конце сессии (когда вы закрываете страницу или окно браузера). Более подробно о сроках хранения и примерах использование различных файлов cookie описано в п.п. 3.3.; 4.1.3. нашей Политики cookie (https://ApplicationP2E.com/cookiePolicy)."
    ,"7. ГДЕ ХРАНИТСЯ И ОБРАБАТЫВАЕТСЯ ВАША ПЕРСОНАЛЬНАЯ ИНФОРМАЦИЯ"
    ,"7.1. Ваша Персональная информация будет храниться в Российской Федерации и/или в ЕЭЗ."
    ,"7.2. Для российских и белорусских пользователей: ApplicationP2E осуществляет запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение персональных данных граждан Российской Федерации с использованием баз данных, находящихся на территории Российской Федерации."
    ,"7.3. Для пользователей из ЕЭЗ: ApplicationP2E осуществляет запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение персональных данных граждан из ЕЭЗ с использованием баз данных, находящихся на территории ЕЭЗ."
    ,"7.4. Если вы находитесь на территории, где для передачи вашей Личной информации в другую юрисдикцию требуется ваше согласие, то, используя Сайты или Сервисы, вы даёте ApplicationP2E своё явное и однозначное согласие на такую передачу или хранение, и/или обработку информации в других указанных юрисдикциях, включая Россию."
    ,"7.5. ApplicationP2E также использует соответствующие меры для обеспечения того, чтобы такая передача осуществлялась в соответствии с действующими правилами защиты данных ЕС и России (при передаче данных граждан России). ApplicationP2E также использует Стандартные договорные условия, разрешающие передачу вашей Персональной информации в Россию."
    ,"8. КАК ДОЛГО МЫ ХРАНИМ ВАШУ ПЕРСОНАЛЬНУЮ ИНФОРМАЦИЮ"
    ,"8.1. ApplicationP2E хранит ваши данные в течение такого периода времени, который необходим для достижения цели, для которой они были собраны, или для соблюдения требований законодательства и нормативных актов."
    ,"8.2. Если вы хотите, чтобы какая-либо ваша Персональная информация была удалена, вы можете обратиться к нам с соответствующим запросом. Для вашего удобства мы составили набор принципов, которыми мы руководствуемся при получении запроса субъекта персональных данных (https://ApplicationP2E.com/dsar)"
    ,"8.3. По истечении периода хранения ваши данные удаляются или анонимизируются."
    ,"8.4. В случае если ваши данные были собраны и обрабатываются на основе вашего согласия на обработку вашей персональной информации – мы удалим ваши данные без разрыва прочих, юридических отношений, если вы отзовёте ваше согласие. Ваш отказ не повлияет на ваш юридический статус, однако может ограничить доступный вам функционал на нашем Сайте и/или функционал наших Служб."
    ,"9. ВАШИ ПРАВА"
    ,"9.1. В случае если это предусмотрено применимым законодательством, вы имеете право на доступ к вашей Персональной информации, обрабатываемой ApplicationP2E в соответствии с настоящей Политикой."
    ,"9.2. Если вы считаете, что какая-либо информация, которую ApplicationP2E хранит о вас, некорректная или неполная, вы имеете право потребовать от нас дополнение или исправлению вашей информации."
    ,"9.3. Вы также имеете право ознакомиться с информацией, которую ApplicationP2E хранит о вас."
    ,"9.4. Вы можете потребовать удаления вашей персональной информации или её части, а также отзывать согласие на обработку вашей персональной информации."
    ,"9.5. Вы можете требовать ограничений на обработку вашей Персональной информации."
    ,"9.6. Запросить копию Стандартных договорных условий, разрешающих передачу вашей Персональной информации в Россию и указанных в п.п.7.5. настоящей Политики."
    ,"9.7. Возражать против обработки вашей Персональной информации, если это предусмотрено применимым законодательством."
    ,"9.8. В случаях, предусмотренных применимым законодательством, вы можете также обладать другими правами, не указанными выше."
    ,"9.9. При использовании вами Сервисов передача Персональной информации осуществляется c вашего согласия, выражающего свободную волю и ваш интерес (в частности, на основании договора с вами), и не является обязанностью по закону."
    ,"10. ЯЗЫКОВЫЕ ВЕРСИИ"
    ,"10.1. Если эта Политика переведена на другой язык и между двумя языковыми версиями этой политики существуют коллизии, английская версия этой Политики, размещённая по адресу: https://ApplicationP2E.com/en/privacyPolicy превалирует и считается главной."
    ,"11. ОБРАТНАЯ СВЯЗЬ"
    ,"11.1. ApplicationP2E приветствует ваши вопросы и предложения, касающиеся исполнения или изменения настоящей Политики. Пожалуйста, воспользуйтесь нашей формой обратной связи, размещённой по адресу: https://support.ApplicationP2E.com/hc/ru/requests/new. Вы также можете воспользоваться этой формой (и адресом электронной почты a@ApplicationP2E.com) для направления запросов о реализации ваших прав или жалоб относительно некорректности вашей Персональной информации или незаконности её обработки."
    ,"11.2. Обратите внимание, что ApplicationP2E имеет отдельные принципы обработки запросов субъекта персональных данных. Текущая версия доступна по адресу: https://ApplicationP2E.com/dsar"
]
const [privacy, setPrivacy] = useState({title:"",description:""});
const api = new ApiService();
const funcFetCookie = async () => {
  const data = await api.getPrivacyPolicy();
  setPrivacy(data);
};
useEffect(() => {
  funcFetCookie();
}, []);
console.log(privacy);




return(
    <div className={styles.container}>
        <h1 className={styles.title}>{privacy.title}</h1>
            <div className={styles.line}></div>
            <div className={styles.element} >
                    {privacy.description}
                    
                </div>
           
            <div className={styles.line}></div>
            <div className={styles.footer}>
               Дата вступления в силу: 2000-00-00
               <br/>
               <br/>
               Постоянная ссылка: https://ApplicationP2E.com/privacyPolicy
               <br/>
               <br/>
            </div>
        </div>
    )
}